In [4]:
import pandas as pd
from pandasql import sqldf
q = lambda x: sqldf(x, globals())

In [32]:
activity = pd.DataFrame({'player_id' : [1, 1, 2, 3, 3], 
                         'device_id' : [2, 2, 3, 1, 4],
                         'event_date' : ['2016-03-01', '2016-05-02', 
                                         '2017-06-25', '2016-03-02', '2018-07-03'],
                         'games_played' : [5, 6, 1, 0, 5]})
activity['event_date']=pd.to_datetime(activity['event_date']).dt.date

In [33]:
activity

   player_id  device_id  event_date  games_played
0          1          2  2016-03-01             5
1          1          2  2016-05-02             6
2          2          3  2017-06-25             1
3          3          1  2016-03-02             0
4          3          4  2018-07-03             5

### Write an SQL query that reports the first login date for each player.

In [34]:
main_table = q('''SELECT player_id, event_date,
                  rank() OVER (PARTITION BY player_id ORDER BY event_date) as rank_date 
                  FROM activity''')

In [35]:
main_table

   player_id  event_date  rank_date
0          1  2016-03-01          1
1          1  2016-05-02          2
2          2  2017-06-25          1
3          3  2016-03-02          1
4          3  2018-07-03          2

In [36]:
q('''SELECT player_id, event_date
     FROM main_table
     WHERE rank_date = 1''')

   player_id  event_date
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02